Revit 2024 API
IntersectionResultArray.ForwardIterator Method
Retrieve a forward moving iterator to the array.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual IntersectionResultArrayIterator ForwardIterator()
Visual Basic
Public Overridable Function ForwardIterator As IntersectionResultArrayIterator
Visual C++
public:
virtual IntersectionResultArrayIterator^ ForwardIterator()
Return Value
Returns a forward moving iterator to the array.
See Also
IntersectionResultArray Class
Autodesk.Revit.DB Namespace